def brakets(str)
  temp = 0
  str.chars.each do |char|
    temp += ( char == "(" ? 1 : -1 )
    return " строка невалидна " if temp < 0
  end
  temp == 0 ? "все нормально - строка валидна" : " строка невалидна "
end

def test_brakets()
  print "Задача z2 валидация строки."
  p ""
  n = "((()())())"
  p n
  p "Строка должна быть валидна"
  p brakets(n)
  p "      ====================================="
  n = "((()())"
  p n
  p "Строка должна быть НЕвалидна"
  p brakets(n)
  p "      ====================================="
  n = "()))(("
  p n
  p "Строка должна быть НЕвалидна"
  p brakets(n)
  p "      ====================================="
end

test_brakets
